<!DOCTYPE html>
<html lang="en">

<head>
    <meta charset="UTF-8" />
    <meta http-equiv="X-UA-Compatible" content="IE=edge" />
    <script src="https://code.jquery.com/jquery-3.3.1.slim.min.js"
        integrity="sha384-q8i/X+965DzO0rT7abK41JStQIAqVgRVzpbzo5smXKp4YfRvH+8abtTE1Pi6jizo"
        crossorigin="anonymous"></script>
    <script src="https://cdn.jsdelivr.net/npm/popper.js@1.14.7/dist/umd/popper.min.js"
        integrity="sha384-UO2eT0CpHqdSJQ6hJty5KVphtPhzWj9WO1clHTMGa3JDZwrnQq4sF86dIHNDz0W1"
        crossorigin="anonymous"></script>
    <script src="https://cdn.jsdelivr.net/npm/bootstrap@4.3.1/dist/js/bootstrap.min.js"
        integrity="sha384-JjSmVgyd0p3pXB1rRibZUAYoIIy6OrQ6VrjIEaFf/nJGzIxFDsf4x0xIM+B07jRM"
        crossorigin="anonymous"></script>
    <link rel="stylesheet" href="style.css" />
    <link rel="stylesheet" href="https://cdn.jsdelivr.net/npm/bootstrap@4.3.1/dist/css/bootstrap.min.css"
        integrity="sha384-ggOyR0iXCbMQv3Xipma34MD+dH/1fQ784/j6cY/iJTQUOhcWr7x9JvoRxT2MZw1T" crossorigin="anonymous" />
    <meta name="viewport" content="width=device-width, initial-scale=1.0" />
    <title>Segurança de Sistemas</title>
</head>

<body>
    <nav class="navbar navbar-expand-lg navbar-light bg-light">
        <a class="navbar-brand" href="#">Navbar</a>
        <button class="navbar-toggler" type="button" data-toggle="collapse" data-target="#navbarNavAltMarkup"
            aria-controls="navbarNavAltMarkup" aria-expanded="false" aria-label="Toggle navigation">
            <span class="navbar-toggler-icon"></span>
        </button>
        <div class="collapse navbar-collapse" id="navbarNavAltMarkup">
            <div class="navbar-nav">
                <a class="nav-item nav-link active" href="./index.html">Home <span class="sr-only">(current)</span></a>
                <a class="nav-item nav-link" href="./sobre-mim.html">Sobre Mim</a>
            </div>
        </div>
    </nav>
    <div class="container">
        <h1>Segurança Mobile</h1>
        <h2>Os riscos e as vulnerabilidades</h2>
        <p>Desempenhando um papel fundamental na sociedade moderna em nas nossas vidas di&aacute;rias, os dispositivos
            m&oacute;veis, como smartphones e tablets, tem um crescente uso, tanto que o android &eacute; mais usado que
            o pr&oacute;prio windows h&aacute; 6 anos[1] e tamb&eacute;m temos um crescente uso desse tipo de tecnologia
            nas empresas, pois a pesquisa mostra que o aumento da mobilidade ajuda as empresas a melhorar as
            opera&ccedil;&otilde;es e a produtividade. Por&eacute;m esse uso recente vem acompanhado de falhas de
            sistema, vulnerabilidades e mais outros riscos que devemos ficar atentos.[2]H&aacute; muitos tipos de
            malwares que podem ser encontrados direcionados aos dispositivos m&oacute;veis, por exemplo nos chamados
            aplicativos maliciosos onde tem-se &nbsp;aplicativos n&atilde;o oficiais, ou desenvolvidos com o objetivo de
            roubar informa&ccedil;&otilde;es pessoais ou exibir an&uacute;ncios indesejados, eles acabam sendo usados
            pelos usu&aacute;rios e isso pode acarretar em uma varia&ccedil;&atilde;o de malwares, spyware, entre
            outros. [3]&nbsp;</p>
        <p>Tamb&eacute;m outra forma que conseguem roubar dados e aplicar golpes &eacute; por phishing que &eacute; uma
            t&eacute;cnica de engenharia social que utiliza mensagens fraudulentas, como e-mails e SMS (smishing), para
            enganar o usu&aacute;rio e fazer com que ele revele informa&ccedil;&otilde;es pessoais ou financeiras. Outro
            problema que deve ser levado em conta s&atilde;o as redes Wi-Fi e Bluetooth inseguras ao conectarem-se a
            redes Wi-Fi p&uacute;blicas n&atilde;o seguras ou deixar o Bluetooth ligado acaba-se por expor o dispositivo
            a intercepta&ccedil;&otilde;es e ataques de hackers. E uma que acaba sendo bastante comum em dispositivos
            m&oacute;veis &eacute; a vulnerabilidades do sistema operacional dispositivos s&atilde;o afetados por
            vulnerabilidades em seu sistema operacional, que podem ser exploradas por hackers para acessar
            informa&ccedil;&otilde;es confidenciais ou controlar o dispositivo.</p>
        <h2>A import&acirc;ncia de proteger dispositivos m&oacute;veis:</h2>
        <p>No que se trata da import&acirc;ncia de proteger dispositivos m&oacute;veis, proteger os dispositivos
            m&oacute;veis &eacute; crucial por v&aacute;rias raz&otilde;es, incluindo a prote&ccedil;&atilde;o de
            informa&ccedil;&otilde;es pessoais como dispositivos m&oacute;veis armazenam muitas
            informa&ccedil;&otilde;es pessoais, tipo fotos, contatos, e-mails, mensagens e dados banc&aacute;rios, a
            prote&ccedil;&atilde;o dessas informa&ccedil;&otilde;es &eacute; essencial para evitar roubo de identidade e
            fraudes. Tamb&eacute;m temos a preserva&ccedil;&atilde;o da privacidade quando se &nbsp;protege os
            dispositivos m&oacute;veis ajuda a garantir que a privacidade seja mantida e que as
            informa&ccedil;&otilde;es pessoais n&atilde;o sejam compartilhadas sem o consentimento do
            usu&aacute;rio.&nbsp;</p>
        <p>Protegendo os anteriores tamb&eacute;m ajuda com a preven&ccedil;&atilde;o de perda financeira, pois
            dispositivos m&oacute;veis podem ser usados para acessar contas banc&aacute;rias e realizar
            transa&ccedil;&otilde;es financeiras, sendo assim essencial proteger esses dispositivos ajudando a evitar
            perdas financeiras devido a fraudes ou roubo de informa&ccedil;&otilde;es. Por &uacute;ltimo tamb&eacute;m
            tem-se a manuten&ccedil;&atilde;o da integridade do dispositivo com a prote&ccedil;&atilde;o adequada dos
            dispositivos m&oacute;veis ajuda-se a evitar danos causados por malware e garante-se o bom funcionamento do
            dispositivo</p>
        <h2>As principais medidas de prote&ccedil;&atilde;o</h2>
        <p>Dentre as principais medidas de prote&ccedil;&atilde;o podem-se elencar atualiza&ccedil;&atilde;o de
            softwares, pois as atualiza&ccedil;&otilde;es geralmente incluem corre&ccedil;&otilde;es de seguran&ccedil;a
            para vulnerabilidades conhecidas, a utiliza&ccedil;&atilde;o de senhas fortes, pois torna mais
            dif&iacute;cil um ataque de for&ccedil;a bruta, a autentica&ccedil;&atilde;o de dois fatores, pois isso
            adiciona uma camada extra de seguran&ccedil;a, a instala&ccedil;&atilde;o de aplicativos confi&aacute;veis,
            pois isso ajuda a n&atilde;o termos o problema j&aacute; citado anteriormente com aplicativos maliciosos. Um
            bom e confi&aacute;vel antiv&iacute;rus, para ajudar na detec&ccedil;&atilde;o e remo&ccedil;&atilde;o de
            malwares, o uso de redes Wi-Fi seguras, para evitar de outro dos problemas j&aacute; citados o de redes
            inseguras, a desativa&ccedil;&atilde;o recursos n&atilde;o utilizados desativar o Bluetooth, o Wi-Fi e a
            localiza&ccedil;&atilde;o GPS quando n&atilde;o estiverem em uso, para reduzir o risco de acessos n&atilde;o
            autorizados e melhorar a seguran&ccedil;a geral do dispositivo, backups s&atilde;o importantes, para que
            possam ser restaurados em caso de perda, roubo ou dano. &nbsp;A criptografia de dados, para proteger
            informa&ccedil;&otilde;es pessoais e confidenciais em caso de perda ou roubo do dispositivo. Bloqueio de
            tela e recursos antirroubo, para localizar, bloquear ou apagar remotamente o dispositivo em caso de perda ou
            roubo.[4]</p>
        <h2>Configura&ccedil;&otilde;es de seguran&ccedil;a</h2>
        <p>As configura&ccedil;&otilde;es de seguran&ccedil;a mais comuns s&atilde;o, primeiro, o bloqueio por senha, o
            mais b&aacute;sico de todos, pois com o bloqueio por pode-se fazer. Outro recurso &eacute; a
            verifica&ccedil;&atilde;o em duas etapas, esse &eacute; um recurso de seguran&ccedil;a que exige que os
            usu&aacute;rios forne&ccedil;am duas formas de autentica&ccedil;&atilde;o ao acessar suas contas online.
            Isso geralmente envolve o uso de uma senha e um c&oacute;digo &uacute;nico gerado por um aplicativo
            autenticador ou enviado via SMS, o que n&atilde;o &eacute; muito recomendado no brasil, pois existem ataques
            de engenharia social onde o n&uacute;mero &eacute; passado para uma pessoa fingindo ser voc&ecirc; (SIM
            Swap) &nbsp;o correto seria usar o aplicativo autenticador e uma chave de acesso que pode ser anotada e
            usada em caso de roubo do dispositivo. O uso de VPN &eacute; importante tamb&eacute;m &eacute; outra
            configura&ccedil;&atilde;o que vale a pena destacar, pois cria uma conex&atilde;o segura e criptografada
            entre seu dispositivo m&oacute;vel e a internet. Gerenciamento de permiss&otilde;es de aplicativos correto
            &eacute; importante tamb&eacute;m, pois limita o acesso apenas &agrave;s fun&ccedil;&otilde;es
            necess&aacute;rias. Atualiza&ccedil;&otilde;es autom&aacute;ticas s&atilde;o de extrema import&acirc;ncia
            para evitar ataques que se aproveitem de falhas que foram j&aacute; amplamente divulgadas.
            Configura&ccedil;&otilde;es de privacidade, para controlar o compartilhamento de informa&ccedil;&otilde;es
            pessoais e o rastreamento de localiza&ccedil;&atilde;o.[4][5]</p>
        <h2>Atualiza&ccedil;&otilde;es de software</h2>
        <p>Entre os motivos para fazer atualiza&ccedil;&otilde;es de software o j&aacute; citado que as
            atualiza&ccedil;&otilde;es ajudam a corrigir falhas de seguran&ccedil;a, tamb&eacute;m tem-se que as
            atualiza&ccedil;&otilde;es de software fazem muitas coisas como adi&ccedil;&atilde;o de novas
            funcionalidades e etc.. Elas tamb&eacute;m ajudam a proteger os dados dos usu&aacute;rios, pois muitos
            documentos e informa&ccedil;&otilde;es pessoais est&atilde;o em dispositivos m&oacute;veis.[6] Para
            configurar basta o usu&aacute;rio digitar o modelo do seu celular na internet e ver tutoriais de como
            faz-lo.</p>
        <h2>Aplicativos maliciosos</h2>
        <p>Os aplicativos maliciosos s&atilde;o um problema que pode ser evitado com algumas dicas dentre elas, baixando
            aplicativos de fontes confi&aacute;veis como lojas oficiais e coisas do tipo, verificar as permiss&otilde;es
            do aplicativo se tiver coisas desnecess&aacute;rias desconfiar &eacute; sempre bom. Ler as
            avalia&ccedil;&otilde;es e classifica&ccedil;&otilde;es, pois outros usu&aacute;rios podem ajudar a
            identificar um poss&iacute;vel app malicioso. Investigando o desenvolvedor, para evitar aplicativos de
            desenvolvedores desconhecidos ou com hist&oacute;rico duvidoso. Instale um software antiv&iacute;rus, isso
            pode ajudar a identificar e remover aplicativos maliciosos antes que causem dano, evitar instalar
            aplicativos de fontes desconhecidas, para correr menos riscos.[2][4]</p>
        <hr>
        <p>[1]https://g1.globo.com/tecnologia/noticia/android-passa-windows-e-se-torna-o-sistema-operacional-mais-usado-do-mundo.ghtml&nbsp;
        </p>
        <p>[2]https://auth0.com/blog/the-9-most-common-security-threats-to-mobile-devices-in-2021/&nbsp;</p>
        <p>[3]https://www.isaca.org/resources/isaca-journal/issues/2016/volume-4/mobile-computing-device-threats-vulnerabilities-and-risk-are-ubiquitous&nbsp;
        </p>
        <p>[4]https://www.cisa.gov/news-events/news/securing-wireless-networks</p>
        <p>[5]https://gizmodo.uol.com.br/golpes-celular-comuns/</p>
        <p>[6]https://us.norton.com/blog/how-to/the-importance-of-general-software-updates-and-patches</p>




    </div>
    <footer class="blockquote-footer">
        <div class="card">
            <div class="card-header">
                © Gabriel Solanha. 2023 All rigths reserved
            </div>
            <div class="card-body">
                <blockquote class="blockquote mb-0">
                    <p>Estudar não é saber o que você quer, estudar é saber o que é.</p>
                    Author: <cite title="Source Title">Paulo Muzy</cite>
                </blockquote>
            </div>
        </div>
    </footer>
</body>

</html>