<!DOCTYPE html>
<html lang="en">

<head>
  <meta charset="UTF-8" />
  <meta http-equiv="X-UA-Compatible" content="IE=edge" />
  <script src="https://code.jquery.com/jquery-3.3.1.slim.min.js"
    integrity="sha384-q8i/X+965DzO0rT7abK41JStQIAqVgRVzpbzo5smXKp4YfRvH+8abtTE1Pi6jizo"
    crossorigin="anonymous"></script>
  <script src="https://cdn.jsdelivr.net/npm/popper.js@1.14.7/dist/umd/popper.min.js"
    integrity="sha384-UO2eT0CpHqdSJQ6hJty5KVphtPhzWj9WO1clHTMGa3JDZwrnQq4sF86dIHNDz0W1"
    crossorigin="anonymous"></script>
  <script src="https://cdn.jsdelivr.net/npm/bootstrap@4.3.1/dist/js/bootstrap.min.js"
    integrity="sha384-JjSmVgyd0p3pXB1rRibZUAYoIIy6OrQ6VrjIEaFf/nJGzIxFDsf4x0xIM+B07jRM"
    crossorigin="anonymous"></script>
  <link rel="stylesheet" href="style.css" />
  <link rel="stylesheet" href="https://cdn.jsdelivr.net/npm/bootstrap@4.3.1/dist/css/bootstrap.min.css"
    integrity="sha384-ggOyR0iXCbMQv3Xipma34MD+dH/1fQ784/j6cY/iJTQUOhcWr7x9JvoRxT2MZw1T" crossorigin="anonymous" />
  <meta name="viewport" content="width=device-width, initial-scale=1.0" />
  <title>Segurança de Sistemas</title>
</head>

<body>
  <nav class="navbar navbar-expand-lg navbar-light bg-light">
    <a class="navbar-brand" href="#">Navbar</a>
    <button class="navbar-toggler" type="button" data-toggle="collapse" data-target="#navbarNavAltMarkup"
      aria-controls="navbarNavAltMarkup" aria-expanded="false" aria-label="Toggle navigation">
      <span class="navbar-toggler-icon"></span>
    </button>
    <div class="collapse navbar-collapse" id="navbarNavAltMarkup">
      <div class="navbar-nav">
        <a class="nav-item nav-link active" href="./index.html">Home <span class="sr-only">(current)</span></a>
        <a class="nav-item nav-link" href="./sobre-mim.html">Sobre Mim</a>
      </div>
    </div>
  </nav>
  <div class="container">
    <h1>Requisitos de Segurança</h1>
    <h2>Introdu&ccedil;&atilde;o</h2>
    <p>A <strong>seguran&ccedil;a de sistemas da informa&ccedil;&atilde;o</strong> tem se tornado cada vez mais crucial
      &agrave; medida que a depend&ecirc;ncia de tecnologia aumenta em todos os aspectos da vida moderna. Este artigo
      abordar&aacute; conceitos-chave como ativos, confidencialidade, integridade, disponibilidade, irretratabilidade,
      autenticidade, amea&ccedil;as e vulnerabilidades, riscos, impacto, contramedidas, aceita&ccedil;&atilde;o de
      risco, advers&aacute;rios, atacantes e agentes.</p>
    <h2>Ativos</h2>
    <p>Os <strong>ativos</strong> s&atilde;o recursos de valor que uma organiza&ccedil;&atilde;o deseja proteger, como
      informa&ccedil;&otilde;es, sistemas, hardware e software. A prote&ccedil;&atilde;o desses ativos &eacute;
      fundamental para garantir a continuidade dos neg&oacute;cios e prevenir perdas financeiras ou danos &agrave;
      reputa&ccedil;&atilde;o.</p>
    <h2>Confidencialidade, Integridade e Disponibilidade (CID)</h2>
    <p>A <strong>confidencialidade</strong> se refere &agrave; prote&ccedil;&atilde;o das informa&ccedil;&otilde;es
      contra o acesso n&atilde;o autorizado. A <strong>integridade</strong> envolve a garantia de que as
      informa&ccedil;&otilde;es n&atilde;o sejam modificadas ou corrompidas por pessoas n&atilde;o autorizadas. A
      <strong>disponibilidade</strong> assegura que as informa&ccedil;&otilde;es e os sistemas estejam acess&iacute;veis
      quando necess&aacute;rio. Juntas, essas tr&ecirc;s propriedades formam o princ&iacute;pio conhecido como CID.
    </p>
    <h2>Irretratabilidade e Autenticidade</h2>
    <p>A <strong>irretratabilidade</strong> (ou <strong>n&atilde;o rep&uacute;dio</strong>) &eacute; a capacidade de
      provar que uma a&ccedil;&atilde;o ou evento ocorreu, de modo que nenhuma das partes envolvidas possa negar sua
      participa&ccedil;&atilde;o. A <strong>autenticidade</strong> &eacute; a garantia de que as
      informa&ccedil;&otilde;es e entidades envolvidas s&atilde;o genu&iacute;nas e n&atilde;o foram forjadas ou
      alteradas.</p>
    <h2>Amea&ccedil;as e Vulnerabilidades</h2>
    <p>As <strong>amea&ccedil;as</strong> s&atilde;o eventos ou a&ccedil;&otilde;es que podem levar a
      viola&ccedil;&otilde;es de seguran&ccedil;a. As <strong>vulnerabilidades</strong> s&atilde;o fraquezas nos
      sistemas ou processos que podem ser exploradas por atacantes para comprometer a seguran&ccedil;a. Identificar e
      mitigar vulnerabilidades &eacute; uma parte essencial da seguran&ccedil;a da informa&ccedil;&atilde;o.</p>
    <h2>Riscos, Impacto e Contramedidas</h2>
    <strong>
      <p>Riscos
    </strong> s&atilde;o a probabilidade de uma amea&ccedil;a explorar uma vulnerabilidade e causar
    danos aos ativos. O <strong>impacto</strong> refere-se &agrave;s consequ&ecirc;ncias negativas que podem ocorrer
    se a seguran&ccedil;a for comprometida. As <strong>contramedidas</strong> s&atilde;o a&ccedil;&otilde;es tomadas
    para reduzir riscos e impactos, como firewalls, criptografia e treinamento de funcion&aacute;rios.</p>
    <h2>Aceitando o Risco</h2>
    <p>Aceitar o <strong>risco</strong> &eacute; o processo de reconhecer que nem todos os riscos podem ser eliminados e
      que algumas vulnerabilidades podem permanecer. Uma organiza&ccedil;&atilde;o deve ponderar o custo das
      contramedidas em rela&ccedil;&atilde;o aos riscos e impactos potenciais para decidir qual n&iacute;vel de risco
      &eacute; aceit&aacute;vel.</p>
    <h2>Advers&aacute;rio e Atacante</h2>
    <p>Um <strong>advers&aacute;rio</strong> &eacute; uma entidade ou indiv&iacute;duo que deseja comprometer a
      seguran&ccedil;a de um sistema. Um <strong>atacante</strong> &eacute; um tipo de advers&aacute;rio que realiza
      a&ccedil;&otilde;es maliciosas para explorar vulnerabilidades e comprometer a seguran&ccedil;a. Atacantes podem
      ter diferentes motiva&ccedil;&otilde;es, como ganho financeiro, espionagem, ativismo ou simplesmente o desafio
      t&eacute;cnico. A compreens&atilde;o das
      motiva&ccedil;&otilde;es e m&eacute;todos dos atacantes &eacute; essencial para desenvolver estrat&eacute;gias
      eficazes de defesa.</p>
    <h2>Agentes</h2>
    <strong>
      <p>Agentes
    </strong> s&atilde;o entidades ou indiv&iacute;duos que desempenham um papel no ecossistema de
    seguran&ccedil;a da informa&ccedil;&atilde;o. Eles podem ser atacantes, defensores, funcion&aacute;rios,
    fornecedores ou qualquer outra parte envolvida na prote&ccedil;&atilde;o ou comprometimento dos ativos de
    informa&ccedil;&atilde;o. Al&eacute;m disso, agentes tamb&eacute;m podem se referir a programas de software, como
    malware ou ferramentas de seguran&ccedil;a, que atuam autonomamente ou sob o controle de um usu&aacute;rio.</p>
    

    <footer class="blockquote-footer">
      <div class="card">
        <div class="card-header">
          © Gabriel Solanha. 2023 All rigths reserved
        </div>
        <div class="card-body">
          <blockquote class="blockquote mb-0">
            <p>Estudar não é saber o que você quer, estudar é saber o que é.</p>
            Author: <cite title="Source Title">Paulo Muzy</cite>
          </blockquote>
        </div>
      </div>
    </footer>
</body>

</html>